In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

In [3]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [9]:

for table in table_names:
    data = pd.read_csv(f'{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [10]:
pd.read_sql(
    '''
    SELECT * FROM Categories
    ''',
    con,
)

,CategoryID,CategoryName,Description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"
5,6,Meat/Poultry,Prepared meats
6,7,Produce,Dried fruit and bean curd
7,8,Seafood,Seaweed and fish

In [11]:
tasks = 0

In [119]:
pd.read_sql(
    '''
    SELECT * FROM Orders
    ''',
    con,
)

     OrderID  CustomerID  EmployeeID   OrderDate  ShipperID
0      10248          90           5  04.07.1996          3
1      10249          81           6  05.07.1996          1
2      10250          34           4  08.07.1996          2
3      10251          84           3  08.07.1996          1
4      10252          76           4  09.07.1996          2
..       ...         ...         ...         ...        ...
120    10368          20           2  29.11.1996          2
121    10369          75           8  02.12.1996          2
122    10370          14           6  03.12.1996          2
123    10371          41           1  03.12.1996          1
124    10372          62           5  04.12.1996          2

[125 rows x 5 columns]

1.–í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å.

In [203]:
tasks=0
tasks+=1
pd.read_sql(
    '''
    SELECT CustomerName, Country, Address FROM Customers 
    where Country = 'Germany' or Country ='France' or City = 'Madrid'
    ''',
    con,
)

,CustomerName,Country,Address
0,Alfreds Futterkiste,Germany,Obere Str. 57
1,Blauer See Delikatessen,Germany,Forsterstr. 57
2,Blondel p√®re et fils,France,"24, place Kl√©ber"
3,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67"
4,Bon app',France,"12, rue des Bouchers"
5,Drachenblut Delikatessend,Germany,Walserweg 21
6,Du monde entier,France,"67, rue des Cinquante Otages"
7,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86"
8,Folies gourmandes,France,"184, chauss√©e de Tournai"
9,Frankenversand,Germany,Berliner Platz 43
10,France restauration,France,"54, rue Royale"
11,K√∂niglich Essen,Germany,Maubelstr. 90
12,La corne d'abondance,France,"67, avenue de l'Europe"
13,La maison d'Asie,France,1 rue Alsace-Lorraine
14,Lehmanns Marktstand,Germany,Magazinweg 7
15,Morgenstern Gesundkost,Germany,Heerstr. 22
16,Ottilies K√§seladen,Germany,Mehrheimerstr. 369
17,Paris sp√©cialit√©s,France,"265, boulevard Charonne"
18,QUICK-Stop,Germany,Taucherstra√üe 10
19,Romero y tomillo,Spain,"Gran V√≠a, 1"
20,Sp√©cialit√©s du monde,France,"25, rue Lauriston"
21,Toms Spezialit√§ten,Germany,Luisenstr. 48
22,Victuailles en stock,France,"2, rue du Commerce"
23,Vins et alcools Chevalier,France,59 rue de l'Abbaye
24,Die Wandernde Kuh,Germany,Adenauerallee 900

2.–í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π.

In [204]:
tasks+=1
pd.read_sql(
    '''
    SELECT count(Country), Country FROM Customers
    group by Country
    order by count(Country) desc
    LIMIT 3
    
    ''',
    con,
)

   count(Country)  Country
0              13      USA
1              11  Germany
2              11   France

3. –í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è.

In [205]:
tasks+=1
pd.read_sql(
    '''
    SELECT ShipperName,OrderDate FROM Shippers
    join Orders on Shippers.ShipperID = Orders.ShipperID
    order by OrderDate
    limit 1 offset 9
    
    ''',
    con,
)

      ShipperName   OrderDate
0  United Package  03.10.1996

4. –í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏.

In [206]:
tasks+=1
pd.read_sql(
    '''
    WITH temporarytable AS (SELECT OrderID, sum(Price) as TotalPrice FROM Products
    join OrderDetails on Products.ProductID = OrderDetails.ProductID
    group by OrderID
    order by TotalPrice desc
    limit 1)
    SELECT t.OrderID, Products.ProductName, Products.Price FROM temporarytable t
    join OrderDetails on  OrderDetails.OrderID = t.OrderID
    join Products on Products.ProductID = OrderDetails.ProductID
    ''',
    con,
)

   OrderID              ProductName   Price
0    10360        R√∂ssle Sauerkraut   45.60
1    10360  Th√ºringer Rostbratwurst  123.79
2    10360            C√¥te de Blaye  263.50
3    10360                 Maxilaku   20.00
4    10360                Tourti√®re    7.45

5. –ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.

In [207]:
tasks+=1
pd.read_sql(
    '''
    WITH temporarytable AS (SELECT OrderDetails.ProductID, sum(Quantity) as TotalQuantity, ProductName FROM OrderDetails
    join Products on OrderDetails.ProductID = Products.ProductID
    group by OrderDetails.ProductID
    order by sum(OrderDetails.Quantity) desc
    limit 1
    
    )
    SELECT ProductName, OrderID, Quantity, TotalQuantity  FROM temporarytable
    join OrderDetails on temporarytable.ProductID = OrderDetails.ProductID

    
    ''',
    con,
)

          ProductName  OrderID  Quantity  TotalQuantity
0   Gorgonzola Telino    10253        20            458
1   Gorgonzola Telino    10272        40            458
2   Gorgonzola Telino    10273        15            458
3   Gorgonzola Telino    10325         4            458
4   Gorgonzola Telino    10335        25            458
5   Gorgonzola Telino    10342        56            458
6   Gorgonzola Telino    10356        30            458
7   Gorgonzola Telino    10359        70            458
8   Gorgonzola Telino    10363        20            458
9   Gorgonzola Telino    10374        30            458
10  Gorgonzola Telino    10376        42            458
11  Gorgonzola Telino    10390        60            458
12  Gorgonzola Telino    10393        32            458
13  Gorgonzola Telino    10423        14            458

6.–í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

In [208]:
tasks+=1
pd.read_sql(
    '''
    SELECT SupplierName	, Country, ContactName, Phone FROM Products
    join OrderDetails on OrderDetails.ProductID = Products.ProductID
    
    join Suppliers on Suppliers.SupplierID = Products.SupplierID
    group by Products.SupplierID
    order by count(OrderID) desc
    limit 5
    ''',
    con,
)

                        SupplierName    Country   ContactName           Phone
0  Plutzer Lebensmittelgro√üm√§rkte AG    Germany   Martin Bein    (069) 992755
1                      Pavlova, Ltd.  Australia   Ian Devling   (03) 444-2343
2           Specialty Biscuits, Ltd.         UK  Peter Wilson  (161) 555-4448
3                    Norske Meierier     Norway  Beate Vileid     (0)2-953010
4            Formaggi Fortini s.r.l.      Italy    Elio Rossi    (0544) 60323

7.–ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É.

In [209]:
tasks+=1
pd.read_sql(
    '''
    SELECT Customers.Country, CategoryName, sum(Price) as TotalSum FROM Customers 
    join Orders on Orders.CustomerID = Customers.CustomerID
    join OrderDetails on OrderDetails.OrderID = Orders.OrderID
    join Products on OrderDetails.ProductID = Products.ProductID
    join Categories on Categories.CategoryID = Products.CategoryID
    where Customers.Country = 'Brazil'
    group by CategoryName
    order by TotalSum desc
    limit 1
    ''',
    con,
)

  Country CategoryName  TotalSum
0  Brazil    Beverages    354.25

8.–ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê.

In [210]:
tasks+=1
pd.read_sql(
    '''
     WITH temporarytable AS (SELECT OrderDetails.OrderID, Customers.Country, sum(Price) as OrderCost FROM Customers 
    join Orders on Orders.CustomerID = Customers.CustomerID
    join OrderDetails on OrderDetails.OrderID = Orders.OrderID
    join Products on OrderDetails.ProductID = Products.ProductID

    where Customers.Country = 'USA'
    group by OrderDetails.OrderID
    )
    SELECT max(OrderCost)-min(OrderCost)  as Difference FROM temporarytable 
   
    ''',
    con,
)

   Difference
0      334.09

9.–í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ.

In [211]:
tasks+=1
pd.read_sql(
    '''
    
    SELECT  count(OrderID) as OrderCount, FirstName || ' ' || LastName as Name  FROM Employees 
    left join Orders on Orders.EmployeeID = Employees.EmployeeID
    
    group by Orders.EmployeeID
    order by BirthDate
    limit 3    
    
        ''',
    con,
)

   OrderCount             Name
0          13   Michael Suyama
1           4   Anne Dodsworth
2           9  Steven Buchanan

10.–°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ.

In [212]:
tasks+=1
pd.read_sql(
    '''
    
    SELECT ProductName, sum(Quantity) as TotalQuantity FROM Orders    
    join OrderDetails on OrderDetails.OrderID = Orders.OrderID
    join Products on OrderDetails.ProductID = Products.ProductID

    where Products.ProductName like '%crab%'
    group by Products.ProductID
    
   
    ''',
    con,
)

        ProductName  TotalQuantity
0  Boston Crab Meat            204

In [213]:
if tasks==10:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ